---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CurveExtents Properties
CurveExtents Class See Also Send Feedback
---

The CurveExtents type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | EndParameter | The end parameter of the curve extents. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | StartParameter | The start parameter of the curve extents. |

# See Also

CurveExtents Class

Autodesk.Revit.DB Namespace